micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_ll_dma.h
/** @defgroup DMA_LL_EC_DEST_ADDR_UPDATE_MODE Burst Destination Address Update Mode
  * @{
  */
#define LL_DMA_BURST_DEST_ADDR_INCREMENT 0x00000000U   /*!< Destination address pointer is incremented after each
                                                            burst transfer by destination update value                */
#define LL_DMA_BURST_DEST_ADDR_DECREMENT DMA_CBR1_DDEC /*!< Destination address pointer is decremented after each
                                                            burst transfer by destination update value                */
/**
  * @}
  */

#if defined (CPU_IN_SECURE_STATE)
/** @defgroup DMA_LL_EC_SOURCE_SECURITY_ATTRIBUTE Source Security Attribute
  * @{
  */
#define LL_DMA_CHANNEL_NSEC 0x00000000U /*!< NSecure channel */
#define LL_DMA_CHANNEL_SEC  0x00000001U /*!< Secure channel  */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_SOURCE_SECURITY_ATTRIBUTE Source Security Attribute
  * @{
  */
#define LL_DMA_CHANNEL_SRC_NSEC 0x00000000U   /*!< NSecure transfer from the source */
#define LL_DMA_CHANNEL_SRC_SEC  DMA_CTR1_SSEC /*!< Secure transfer from the source  */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_DESTINATION_SECURITY_ATTRIBUTE Destination Security Attribute
  * @{
  */
#define LL_DMA_CHANNEL_DEST_NSEC 0x00000000U   /*!< NSecure transfer from the destination */
#define LL_DMA_CHANNEL_DEST_SEC  DMA_CTR1_DSEC /*!< Secure transfer from the destination  */
/**
  * @}
  */
#endif /* CPU_IN_SECURE_STATE */

/** @defgroup DMA_LL_EC_LINKEDLIST_NODE_TYPE Linked list node type
  * @{
  */
#define LL_DMA_GPDMA_LINEAR_NODE 0x01U /*!< GPDMA node : linear addressing node      */
#define LL_DMA_GPDMA_2D_NODE     0x02U /*!< GPDMA node : 2 dimension addressing node */
#define LL_DMA_HPDMA_LINEAR_NODE 0x04U /*!< HPDMA node : linear addressing node      */
#define LL_DMA_HPDMA_2D_NODE     0x08U /*!< HPDMA node : 2 dimension addressing node */

/**
  * @}
  */

/** @defgroup DMA_LL_EC_LINKEDLIST_REGISTER_UPDATE Linked list register update
  * @{
  */
#define LL_DMA_UPDATE_CTR1 DMA_CLLR_UT1 /*!< Update CTR1 register from memory :
                                             available for all DMA channels                */
#define LL_DMA_UPDATE_CTR2 DMA_CLLR_UT2 /*!< Update CTR2 register from memory :
                                             available for all DMA channels                */
#define LL_DMA_UPDATE_CBR1 DMA_CLLR_UB1 /*!< Update CBR1 register from memory :
                                             available for all DMA channels                */
#define LL_DMA_UPDATE_CSAR DMA_CLLR_USA /*!< Update CSAR register from memory :
                                             available for all DMA channels                */
#define LL_DMA_UPDATE_CDAR DMA_CLLR_UDA /*!< Update CDAR register from memory :
                                             available for all DMA channels                */
#define LL_DMA_UPDATE_CTR3 DMA_CLLR_UT3 /*!< Update CTR3 register from memory :
                                             available only for 2D addressing DMA channels */
#define LL_DMA_UPDATE_CBR2 DMA_CLLR_UB2 /*!< Update CBR2 register from memory :
                                             available only for 2D addressing DMA channels */
#define LL_DMA_UPDATE_CLLR DMA_CLLR_ULL /*!< Update CLLR register from memory :
                                             available for all DMA channels                */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_REQUEST_SELECTION Request Selection
  * @{
  */
/* HPDMA1 requests */
#define LL_HPDMA1_REQUEST_JPEG_RX       0U       /*!< HPDMA1 HW request is JPEG_RX        */
#define LL_HPDMA1_REQUEST_JPEG_TX       1U       /*!< HPDMA1 HW request is JPEG_TX        */
#define LL_HPDMA1_REQUEST_OCTOSPI1      2U       /*!< HPDMA1 HW request is OCTOSPI1       */
#define LL_HPDMA1_REQUEST_OCTOSPI2      3U       /*!< HPDMA1 HW request is OCTOSPI2       */
#define LL_HPDMA1_REQUEST_OCTOSPI3      4U       /*!< HPDMA1 HW request is OCTOSPI3       */
#define LL_HPDMA1_REQUEST_FMC2_TXRX     5U       /*!< HPDMA1 HW request is FMC2_TXRX      */
#define LL_HPDMA1_REQUEST_FMC2_BCH      6U       /*!< HPDMA1 HW request is FMC2_BCH       */
#define LL_HPDMA1_REQUEST_ADC1          7U       /*!< HPDMA1 HW request is ADC1           */
#define LL_HPDMA1_REQUEST_ADC2          8U       /*!< HPDMA1 HW request is ADC2           */
#define LL_HPDMA1_REQUEST_CRYP_IN       9U       /*!< HPDMA1 HW request is CRYP_IN        */
#define LL_HPDMA1_REQUEST_CRYP_OUT      10U      /*!< HPDMA1 HW request is CRYP_OUT       */
#define LL_HPDMA1_REQUEST_SAES_OUT      11U      /*!< HPDMA1 HW request is SAES_OUT       */
#define LL_HPDMA1_REQUEST_SAES_IN       12U      /*!< HPDMA1 HW request is SAES_IN        */
#define LL_HPDMA1_REQUEST_HASH_IN       13U      /*!< HPDMA1 HW request is HASH_IN        */

#define LL_HPDMA1_REQUEST_TIM1_CH1      14U      /*!< HPDMA1 HW request is TIM1_CH1       */
#define LL_HPDMA1_REQUEST_TIM1_CH2      15U      /*!< HPDMA1 HW request is TIM1_CH2       */
#define LL_HPDMA1_REQUEST_TIM1_CH3      16U      /*!< HPDMA1 HW request is TIM1_CH3       */
#define LL_HPDMA1_REQUEST_TIM1_CH4      17U      /*!< HPDMA1 HW request is TIM1_CH4       */
#define LL_HPDMA1_REQUEST_TIM1_UP       18U      /*!< HPDMA1 HW request is TIM1_UP        */
#define LL_HPDMA1_REQUEST_TIM1_TRIG     19U      /*!< HPDMA1 HW request is TIM1_TRIG      */
#define LL_HPDMA1_REQUEST_TIM1_COM      20U      /*!< HPDMA1 HW request is TIM1_COM       */

#define LL_HPDMA1_REQUEST_TIM2_CH1      21U      /*!< HPDMA1 HW request is TIM2_CH1       */
#define LL_HPDMA1_REQUEST_TIM2_CH2      22U      /*!< HPDMA1 HW request is TIM2_CH2       */
#define LL_HPDMA1_REQUEST_TIM2_CH3      23U      /*!< HPDMA1 HW request is TIM2_CH3       */
#define LL_HPDMA1_REQUEST_TIM2_CH4      24U      /*!< HPDMA1 HW request is TIM2_CH4       */
#define LL_HPDMA1_REQUEST_TIM2_UP       25U      /*!< HPDMA1 HW request is TIM2_UP        */
#define LL_HPDMA1_REQUEST_TIM2_TRIG     26U      /*!< HPDMA1 HW request is TIM2_TRIG      */

#define LL_HPDMA1_REQUEST_TIM3_CH1      27U      /*!< HPDMA1 HW request is TIM3_CH1       */
#define LL_HPDMA1_REQUEST_TIM3_CH2      28U      /*!< HPDMA1 HW request is TIM3_CH2       */
#define LL_HPDMA1_REQUEST_TIM3_CH3      29U      /*!< HPDMA1 HW request is TIM3_CH3       */
#define LL_HPDMA1_REQUEST_TIM3_CH4      30U      /*!< HPDMA1 HW request is TIM3_CH4       */
#define LL_HPDMA1_REQUEST_TIM3_UP       31U      /*!< HPDMA1 HW request is TIM3_UP        */
#define LL_HPDMA1_REQUEST_TIM3_TRIG     32U      /*!< HPDMA1 HW request is TIM3_TRIG      */

#define LL_HPDMA1_REQUEST_TIM4_CH1      33U      /*!< HPDMA1 HW request is TIM4_CH1       */
#define LL_HPDMA1_REQUEST_TIM4_CH2      34U      /*!< HPDMA1 HW request is TIM4_CH2       */
#define LL_HPDMA1_REQUEST_TIM4_CH3      35U      /*!< HPDMA1 HW request is TIM4_CH3       */
#define LL_HPDMA1_REQUEST_TIM4_CH4      36U      /*!< HPDMA1 HW request is TIM4_CH4       */
#define LL_HPDMA1_REQUEST_TIM4_UP       37U      /*!< HPDMA1 HW request is TIM4_UP        */
#define LL_HPDMA1_REQUEST_TIM4_TRIG     38U      /*!< HPDMA1 HW request is TIM4_TRIG      */

#define LL_HPDMA1_REQUEST_TIM5_CH1      39U      /*!< HPDMA1 HW request is TIM5_CH1       */
#define LL_HPDMA1_REQUEST_TIM5_CH2      40U      /*!< HPDMA1 HW request is TIM5_CH2       */
#define LL_HPDMA1_REQUEST_TIM5_CH3      41U      /*!< HPDMA1 HW request is TIM5_CH3       */
#define LL_HPDMA1_REQUEST_TIM5_CH4      42U      /*!< HPDMA1 HW request is TIM5_CH4       */
#define LL_HPDMA1_REQUEST_TIM5_UP       43U      /*!< HPDMA1 HW request is TIM5_UP        */
#define LL_HPDMA1_REQUEST_TIM5_TRIG     44U      /*!< HPDMA1 HW request is TIM5_TRIG      */

#define LL_HPDMA1_REQUEST_TIM6_UP       45U      /*!< HPDMA1 HW request is TIM6_UP        */
#define LL_HPDMA1_REQUEST_TIM7_UP       46U      /*!< HPDMA1 HW request is TIM7_UP        */

#define LL_HPDMA1_REQUEST_TIM8_CH1      47U      /*!< HPDMA1 HW request is TIM8_CH1       */
#define LL_HPDMA1_REQUEST_TIM8_CH2      48U      /*!< HPDMA1 HW request is TIM8_CH2       */
#define LL_HPDMA1_REQUEST_TIM8_CH3      49U      /*!< HPDMA1 HW request is TIM8_CH3       */
#define LL_HPDMA1_REQUEST_TIM8_CH4      50U      /*!< HPDMA1 HW request is TIM8_CH4       */
#define LL_HPDMA1_REQUEST_TIM8_UP       51U      /*!< HPDMA1 HW request is TIM8_UP        */
#define LL_HPDMA1_REQUEST_TIM8_TRIG     52U      /*!< HPDMA1 HW request is TIM8_TRIG      */
#define LL_HPDMA1_REQUEST_TIM8_COM      53U      /*!< HPDMA1 HW request is TIM8_COM       */

/* reserved                             54U                                               */
/* reserved                             55U                                               */

#define LL_HPDMA1_REQUEST_TIM15_CH1     56U      /*!< HPDMA1 HW request is TIM15_CH1      */
#define LL_HPDMA1_REQUEST_TIM15_CH2     57U      /*!< HPDMA1 HW request is TIM15_CH2      */
#define LL_HPDMA1_REQUEST_TIM15_UP      58U      /*!< HPDMA1 HW request is TIM15_UP       */
#define LL_HPDMA1_REQUEST_TIM15_TRIG    59U      /*!< HPDMA1 HW request is TIM15_TRIG     */
#define LL_HPDMA1_REQUEST_TIM15_COM     60U      /*!< HPDMA1 HW request is TIM15_COM      */

#define LL_HPDMA1_REQUEST_TIM16_CH1     61U      /*!< HPDMA1 HW request is TIM16_CH1      */
#define LL_HPDMA1_REQUEST_TIM16_UP      62U      /*!< HPDMA1 HW request is TIM16_UP       */
#define LL_HPDMA1_REQUEST_TIM16_COM     63U      /*!< HPDMA1 HW request is TIM16_COM      */

#define LL_HPDMA1_REQUEST_TIM17_CH1     64U      /*!< HPDMA1 HW request is TIM17_CH1      */
#define LL_HPDMA1_REQUEST_TIM17_UP      65U      /*!< HPDMA1 HW request is TIM17_UP       */
#define LL_HPDMA1_REQUEST_TIM17_COM     66U      /*!< HPDMA1 HW request is TIM17_COM      */

#define LL_HPDMA1_REQUEST_TIM18_CH1     67U      /*!< HPDMA1 HW request is TIM18_CH1      */
#define LL_HPDMA1_REQUEST_TIM18_UP      68U      /*!< HPDMA1 HW request is TIM18_UP       */
#define LL_HPDMA1_REQUEST_TIM18_COM     69U      /*!< HPDMA1 HW request is TIM18_COM      */

#define LL_HPDMA1_REQUEST_LPTIM1_IC1    70U      /*!< HPDMA1 HW request is LPTIM1_IC1     */
#define LL_HPDMA1_REQUEST_LPTIM1_IC2    71U      /*!< HPDMA1 HW request is LPTIM1_IC2     */
#define LL_HPDMA1_REQUEST_LPTIM1_UE     72U      /*!< HPDMA1 HW request is LPTIM1_UE      */
#define LL_HPDMA1_REQUEST_LPTIM2_IC1    73U      /*!< HPDMA1 HW request is LPTIM2_IC1     */
#define LL_HPDMA1_REQUEST_LPTIM2_IC2    74U      /*!< HPDMA1 HW request is LPTIM2_IC2     */
#define LL_HPDMA1_REQUEST_LPTIM2_UE     75U      /*!< HPDMA1 HW request is LPTIM2_UE      */
#define LL_HPDMA1_REQUEST_LPTIM3_IC1    76U      /*!< HPDMA1 HW request is LPTIM3_IC1     */
#define LL_HPDMA1_REQUEST_LPTIM3_IC2    77U      /*!< HPDMA1 HW request is LPTIM3_IC2     */
#define LL_HPDMA1_REQUEST_LPTIM3_UE     78U      /*!< HPDMA1 HW request is LPTIM3_UE      */

#define LL_HPDMA1_REQUEST_SPI1_RX       79U      /*!< HPDMA1 HW request is SPI1_RX        */
#define LL_HPDMA1_REQUEST_SPI1_TX       80U      /*!< HPDMA1 HW request is SPI1_TX        */
#define LL_HPDMA1_REQUEST_SPI2_RX       81U      /*!< HPDMA1 HW request is SPI2_RX        */
#define LL_HPDMA1_REQUEST_SPI2_TX       82U      /*!< HPDMA1 HW request is SPI2_TX        */
#define LL_HPDMA1_REQUEST_SPI3_RX       83U      /*!< HPDMA1 HW request is SPI3_RX        */
#define LL_HPDMA1_REQUEST_SPI3_TX       84U      /*!< HPDMA1 HW request is SPI3_TX        */
#define LL_HPDMA1_REQUEST_SPI4_RX       85U      /*!< HPDMA1 HW request is SPI4_RX        */
#define LL_HPDMA1_REQUEST_SPI4_TX       86U      /*!< HPDMA1 HW request is SPI4_TX        */
#define LL_HPDMA1_REQUEST_SPI5_RX       87U      /*!< HPDMA1 HW request is SPI5_RX        */
#define LL_HPDMA1_REQUEST_SPI5_TX       88U      /*!< HPDMA1 HW request is SPI5_TX        */
#define LL_HPDMA1_REQUEST_SPI6_RX       89U      /*!< HPDMA1 HW request is SPI6_RX        */
#define LL_HPDMA1_REQUEST_SPI6_TX       90U      /*!< HPDMA1 HW request is SPI6_TX        */

#define LL_HPDMA1_REQUEST_SAI1_A        91U      /*!< HPDMA1 HW request is SAI1_A         */
#define LL_HPDMA1_REQUEST_SAI1_B        92U      /*!< HPDMA1 HW request is SAI1_B         */
#define LL_HPDMA1_REQUEST_SAI2_A        93U      /*!< HPDMA1 HW request is SAI2_A         */
#define LL_HPDMA1_REQUEST_SAI2_B        94U      /*!< HPDMA1 HW request is SAI2_B         */

#define LL_HPDMA1_REQUEST_I2C1_RX       95U      /*!< HPDMA1 HW request is I2C1_RX        */
#define LL_HPDMA1_REQUEST_I2C1_TX       96U      /*!< HPDMA1 HW request is I2C1_TX        */
#define LL_HPDMA1_REQUEST_I2C2_RX       97U      /*!< HPDMA1 HW request is I2C2_RX        */
#define LL_HPDMA1_REQUEST_I2C2_TX       98U      /*!< HPDMA1 HW request is I2C2_TX        */
#define LL_HPDMA1_REQUEST_I2C3_RX       99U      /*!< HPDMA1 HW request is I2C3_RX        */
#define LL_HPDMA1_REQUEST_I2C3_TX       100U     /*!< HPDMA1 HW request is I2C3_TX        */

#define LL_HPDMA1_REQUEST_I2C4_RX       101U     /*!< HPDMA1 HW request is I2C4_RX        */
#define LL_HPDMA1_REQUEST_I2C4_TX       102U     /*!< HPDMA1 HW request is I2C4_TX        */

#define LL_HPDMA1_REQUEST_I3C1_RX       103U     /*!< HPDMA1 HW request is I3C1_RX        */
#define LL_HPDMA1_REQUEST_I3C1_TX       104U     /*!< HPDMA1 HW request is I3C1_TX        */
#define LL_HPDMA1_REQUEST_I3C2_RX       105U     /*!< HPDMA1 HW request is I3C2_RX        */
#define LL_HPDMA1_REQUEST_I3C2_TX       106U     /*!< HPDMA1 HW request is I3C2_TX        */

#define LL_HPDMA1_REQUEST_USART1_RX     107U     /*!< HPDMA1 HW request is USART1_RX      */
#define LL_HPDMA1_REQUEST_USART1_TX     108U     /*!< HPDMA1 HW request is USART1_TX      */
#define LL_HPDMA1_REQUEST_USART2_RX     109U     /*!< HPDMA1 HW request is USART2_RX      */
#define LL_HPDMA1_REQUEST_USART2_TX     110U     /*!< HPDMA1 HW request is USART2_TX      */
#define LL_HPDMA1_REQUEST_USART3_RX     111U     /*!< HPDMA1 HW request is USART3_RX      */
#define LL_HPDMA1_REQUEST_USART3_TX     112U     /*!< HPDMA1 HW request is USART3_TX      */
#define LL_HPDMA1_REQUEST_UART4_RX      113U     /*!< HPDMA1 HW request is UART4_RX       */
#define LL_HPDMA1_REQUEST_UART4_TX      114U     /*!< HPDMA1 HW request is UART4_TX       */
#define LL_HPDMA1_REQUEST_UART5_RX      115U     /*!< HPDMA1 HW request is UART5_RX       */
#define LL_HPDMA1_REQUEST_UART5_TX      116U     /*!< HPDMA1 HW request is UART5_TX       */
#define LL_HPDMA1_REQUEST_USART6_RX     117U     /*!< HPDMA1 HW request is USART6_RX      */
#define LL_HPDMA1_REQUEST_USART6_TX     118U     /*!< HPDMA1 HW request is USART6_TX      */
#define LL_HPDMA1_REQUEST_UART7_RX      119U     /*!< HPDMA1 HW request is UART7_RX       */
#define LL_HPDMA1_REQUEST_UART7_TX      120U     /*!< HPDMA1 HW request is UART7_TX       */
#define LL_HPDMA1_REQUEST_UART8_RX      121U     /*!< HPDMA1 HW request is UART8_RX       */
#define LL_HPDMA1_REQUEST_UART8_TX      122U     /*!< HPDMA1 HW request is UART8_TX       */
#define LL_HPDMA1_REQUEST_UART9_RX      123U     /*!< HPDMA1 HW request is UART9_RX       */
#define LL_HPDMA1_REQUEST_UART9_TX      124U     /*!< HPDMA1 HW request is UART9_TX       */
#define LL_HPDMA1_REQUEST_USART10_RX    125U     /*!< HPDMA1 HW request is USART10_RX     */
#define LL_HPDMA1_REQUEST_USART10_TX    126U     /*!< HPDMA1 HW request is USART10_TX     */

#define LL_HPDMA1_REQUEST_LPUART1_RX    127U     /*!< HPDMA1 HW request is LPUART1_RX     */
#define LL_HPDMA1_REQUEST_LPUART1_TX    128U     /*!< HPDMA1 HW request is LPUART1_TX     */

#define LL_HPDMA1_REQUEST_SPDIFRX_CS    129U     /*!< HPDMA1 HW request is SPDIFRX_CS     */
#define LL_HPDMA1_REQUEST_SPDIFRX_DT    130U     /*!< HPDMA1 HW request is SPDIFRX_DT     */

#define LL_HPDMA1_REQUEST_ADF1_FLT0     131U     /*!< HPDMA1 HW request is ADF1_FLT0      */

