micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_ll_dma.h
#define LL_HPDMA1_REQUEST_MDF1_FLT0     132U     /*!< HPDMA1 HW request is MDF1_FLT0      */
#define LL_HPDMA1_REQUEST_MDF1_FLT1     133U     /*!< HPDMA1 HW request is MDF1_FLT1      */
#define LL_HPDMA1_REQUEST_MDF1_FLT2     134U     /*!< HPDMA1 HW request is MDF1_FLT2      */
#define LL_HPDMA1_REQUEST_MDF1_FLT3     135U     /*!< HPDMA1 HW request is MDF1_FLT3      */
#define LL_HPDMA1_REQUEST_MDF1_FLT4     136U     /*!< HPDMA1 HW request is MDF1_FLT4      */
#define LL_HPDMA1_REQUEST_MDF1_FLT5     137U     /*!< HPDMA1 HW request is MDF1_FLT5      */

#define LL_HPDMA1_REQUEST_UCPD1_TX      138U     /*!< HPDMA1 HW request is UCPD1_TX       */
#define LL_HPDMA1_REQUEST_UCPD1_RX      139U     /*!< HPDMA1 HW request is UCPD1_RX       */

#define LL_HPDMA1_REQUEST_DCMI_PSSI     140U     /*!< HPDMA1 HW request is DCMI_PSSI      */

#define LL_HPDMA1_REQUEST_I3C1_TC       141U     /*!< HPDMA1 HW request is I3C1_TC        */
#define LL_HPDMA1_REQUEST_I3C1_RS       142U     /*!< HPDMA1 HW request is I3C1_RS        */

#define LL_HPDMA1_REQUEST_I3C2_TC       143U     /*!< HPDMA1 HW request is I3C2_TC        */
#define LL_HPDMA1_REQUEST_I3C2_RS       144U     /*!< HPDMA1 HW request is I3C2_RS        */


/* GPDMA1 requests */
#define LL_GPDMA1_REQUEST_JPEG_RX       0U       /*!< GPDMA1 HW request is JPEG_DMA_RX    */
#define LL_GPDMA1_REQUEST_JPEG_TX       1U       /*!< GPDMA1 HW request is JPEG_DMA_TX    */
#define LL_GPDMA1_REQUEST_OCTOSPI1      2U       /*!< GPDMA1 HW request is OCTOSPI1       */
#define LL_GPDMA1_REQUEST_OCTOSPI2      3U       /*!< GPDMA1 HW request is OCTOSPI2       */
#define LL_GPDMA1_REQUEST_OCTOSPI3      4U       /*!< GPDMA1 HW request is OCTOSPI3       */
#define LL_GPDMA1_REQUEST_FMC2_TXRX     5U       /*!< GPDMA1 HW request is FMC2_TXRX      */
#define LL_GPDMA1_REQUEST_FMC2_BCH      6U       /*!< GPDMA1 HW request is FMC2_BCH       */
#define LL_GPDMA1_REQUEST_ADC1          7U       /*!< GPDMA1 HW request is ADC1           */
#define LL_GPDMA1_REQUEST_ADC2          8U       /*!< GPDMA1 HW request is ADC2           */
#define LL_GPDMA1_REQUEST_CRYP_IN       9U       /*!< GPDMA1 HW request is CRYP_IN        */
#define LL_GPDMA1_REQUEST_CRYP_OUT      10U      /*!< GPDMA1 HW request is CRYP_OUT       */
#define LL_GPDMA1_REQUEST_SAES_OUT      11U      /*!< GPDMA1 HW request is SAES_OUT       */
#define LL_GPDMA1_REQUEST_SAES_IN       12U      /*!< GPDMA1 HW request is SAES_IN        */
#define LL_GPDMA1_REQUEST_HASH_IN       13U      /*!< GPDMA1 HW request is HASH_IN        */

#define LL_GPDMA1_REQUEST_TIM1_CH1      14U      /*!< GPDMA1 HW request is TIM1_CH1       */
#define LL_GPDMA1_REQUEST_TIM1_CH2      15U      /*!< GPDMA1 HW request is TIM1_CH2       */
#define LL_GPDMA1_REQUEST_TIM1_CH3      16U      /*!< GPDMA1 HW request is TIM1_CH3       */
#define LL_GPDMA1_REQUEST_TIM1_CH4      17U      /*!< GPDMA1 HW request is TIM1_CH4       */
#define LL_GPDMA1_REQUEST_TIM1_UP       18U      /*!< GPDMA1 HW request is TIM1_UP        */
#define LL_GPDMA1_REQUEST_TIM1_TRIG     19U      /*!< GPDMA1 HW request is TIM1_TRIG      */
#define LL_GPDMA1_REQUEST_TIM1_COM      20U      /*!< GPDMA1 HW request is TIM1_COM       */

#define LL_GPDMA1_REQUEST_TIM2_CH1      21U      /*!< GPDMA1 HW request is TIM2_CH1       */
#define LL_GPDMA1_REQUEST_TIM2_CH2      22U      /*!< GPDMA1 HW request is TIM2_CH2       */
#define LL_GPDMA1_REQUEST_TIM2_CH3      23U      /*!< GPDMA1 HW request is TIM2_CH3       */
#define LL_GPDMA1_REQUEST_TIM2_CH4      24U      /*!< GPDMA1 HW request is TIM2_CH4       */
#define LL_GPDMA1_REQUEST_TIM2_UP       25U      /*!< GPDMA1 HW request is TIM2_UP        */
#define LL_GPDMA1_REQUEST_TIM2_TRIG     26U      /*!< GPDMA1 HW request is TIM2_TRIG      */

#define LL_GPDMA1_REQUEST_TIM3_CH1      27U      /*!< GPDMA1 HW request is TIM3_CH1       */
#define LL_GPDMA1_REQUEST_TIM3_CH2      28U      /*!< GPDMA1 HW request is TIM3_CH2       */
#define LL_GPDMA1_REQUEST_TIM3_CH3      29U      /*!< GPDMA1 HW request is TIM3_CH3       */
#define LL_GPDMA1_REQUEST_TIM3_CH4      30U      /*!< GPDMA1 HW request is TIM3_CH4       */
#define LL_GPDMA1_REQUEST_TIM3_UP       31U      /*!< GPDMA1 HW request is TIM3_UP        */
#define LL_GPDMA1_REQUEST_TIM3_TRIG     32U      /*!< GPDMA1 HW request is TIM3_TRIG      */

#define LL_GPDMA1_REQUEST_TIM4_CH1      33U      /*!< GPDMA1 HW request is TIM4_CH1       */
#define LL_GPDMA1_REQUEST_TIM4_CH2      34U      /*!< GPDMA1 HW request is TIM4_CH2       */
#define LL_GPDMA1_REQUEST_TIM4_CH3      35U      /*!< GPDMA1 HW request is TIM4_CH3       */
#define LL_GPDMA1_REQUEST_TIM4_CH4      36U      /*!< GPDMA1 HW request is TIM4_CH4       */
#define LL_GPDMA1_REQUEST_TIM4_UP       37U      /*!< GPDMA1 HW request is TIM4_UP        */
#define LL_GPDMA1_REQUEST_TIM4_TRIG     38U      /*!< GPDMA1 HW request is TIM4_TRIG      */

#define LL_GPDMA1_REQUEST_TIM5_CH1      39U      /*!< GPDMA1 HW request is TIM5_CH1       */
#define LL_GPDMA1_REQUEST_TIM5_CH2      40U      /*!< GPDMA1 HW request is TIM5_CH2       */
#define LL_GPDMA1_REQUEST_TIM5_CH3      41U      /*!< GPDMA1 HW request is TIM5_CH3       */
#define LL_GPDMA1_REQUEST_TIM5_CH4      42U      /*!< GPDMA1 HW request is TIM5_CH4       */
#define LL_GPDMA1_REQUEST_TIM5_UP       43U      /*!< GPDMA1 HW request is TIM5_UP        */
#define LL_GPDMA1_REQUEST_TIM5_TRIG     44U      /*!< GPDMA1 HW request is TIM5_TRIG      */

#define LL_GPDMA1_REQUEST_TIM6_UP       45U      /*!< GPDMA1 HW request is TIM6_UP        */
#define LL_GPDMA1_REQUEST_TIM7_UP       46U      /*!< GPDMA1 HW request is TIM6_UP        */

#define LL_GPDMA1_REQUEST_TIM8_CH1      47U      /*!< GPDMA1 HW request is TIM8_CH1       */
#define LL_GPDMA1_REQUEST_TIM8_CH2      48U      /*!< GPDMA1 HW request is TIM8_CH2       */
#define LL_GPDMA1_REQUEST_TIM8_CH3      49U      /*!< GPDMA1 HW request is TIM8_CH3       */
#define LL_GPDMA1_REQUEST_TIM8_CH4      50U      /*!< GPDMA1 HW request is TIM8_CH4       */
#define LL_GPDMA1_REQUEST_TIM8_UP       51U      /*!< GPDMA1 HW request is TIM8_UP        */
#define LL_GPDMA1_REQUEST_TIM8_TRIG     52U      /*!< GPDMA1 HW request is TIM8_TRIG      */
#define LL_GPDMA1_REQUEST_TIM8_COM      53U      /*!< GPDMA1 HW request is TIM8_COM       */

/* reserved                             54U                                               */
/* reserved                             55U                                               */

#define LL_GPDMA1_REQUEST_TIM15_CH1     56U      /*!< GPDMA1 HW request is TIM15_CH1      */
#define LL_GPDMA1_REQUEST_TIM15_CH2     57U      /*!< GPDMA1 HW request is TIM15_CH2      */
#define LL_GPDMA1_REQUEST_TIM15_UP      58U      /*!< GPDMA1 HW request is TIM15_UP       */
#define LL_GPDMA1_REQUEST_TIM15_TRIG    59U      /*!< GPDMA1 HW request is TIM15_TRIG     */
#define LL_GPDMA1_REQUEST_TIM15_COM     60U      /*!< GPDMA1 HW request is TIM15_COM      */

#define LL_GPDMA1_REQUEST_TIM16_CH1     61U      /*!< GPDMA1 HW request is TIM16_CH1      */
#define LL_GPDMA1_REQUEST_TIM16_UP      62U      /*!< GPDMA1 HW request is TIM16_UP       */
#define LL_GPDMA1_REQUEST_TIM16_COM     63U      /*!< GPDMA1 HW request is TIM16_COM      */

#define LL_GPDMA1_REQUEST_TIM17_CH1     64U      /*!< GPDMA1 HW request is TIM17_CH1      */
#define LL_GPDMA1_REQUEST_TIM17_UP      65U      /*!< GPDMA1 HW request is TIM17_UP       */
#define LL_GPDMA1_REQUEST_TIM17_COM     66U      /*!< GPDMA1 HW request is TIM17_COM      */

#define LL_GPDMA1_REQUEST_TIM18_CH1     67U      /*!< GPDMA1 HW request is TIM18_CH1      */
#define LL_GPDMA1_REQUEST_TIM18_UP      68U      /*!< GPDMA1 HW request is TIM18_UP       */
#define LL_GPDMA1_REQUEST_TIM18_COM     69U      /*!< GPDMA1 HW request is TIM18_COM      */

#define LL_GPDMA1_REQUEST_LPTIM1_IC1    70U      /*!< GPDMA1 HW request is LPTIM1_IC1     */
#define LL_GPDMA1_REQUEST_LPTIM1_IC2    71U      /*!< GPDMA1 HW request is LPTIM1_IC2     */
#define LL_GPDMA1_REQUEST_LPTIM1_UE     72U      /*!< GPDMA1 HW request is LPTIM1_UE      */
#define LL_GPDMA1_REQUEST_LPTIM2_IC1    73U      /*!< GPDMA1 HW request is LPTIM2_IC1     */
#define LL_GPDMA1_REQUEST_LPTIM2_IC2    74U      /*!< GPDMA1 HW request is LPTIM2_IC2     */
#define LL_GPDMA1_REQUEST_LPTIM2_UE     75U      /*!< GPDMA1 HW request is LPTIM2_UE      */
#define LL_GPDMA1_REQUEST_LPTIM3_IC1    76U      /*!< GPDMA1 HW request is LPTIM3_IC1     */
#define LL_GPDMA1_REQUEST_LPTIM3_IC2    77U      /*!< GPDMA1 HW request is LPTIM3_IC2     */
#define LL_GPDMA1_REQUEST_LPTIM3_UE     78U      /*!< GPDMA1 HW request is LPTIM3_UE      */

#define LL_GPDMA1_REQUEST_SPI1_RX       79U      /*!< GPDMA1 HW request is SPI1_RX        */
#define LL_GPDMA1_REQUEST_SPI1_TX       80U      /*!< GPDMA1 HW request is SPI1_TX        */
#define LL_GPDMA1_REQUEST_SPI2_RX       81U      /*!< GPDMA1 HW request is SPI2_RX        */
#define LL_GPDMA1_REQUEST_SPI2_TX       82U      /*!< GPDMA1 HW request is SPI2_TX        */
#define LL_GPDMA1_REQUEST_SPI3_RX       83U      /*!< GPDMA1 HW request is SPI3_RX        */
#define LL_GPDMA1_REQUEST_SPI3_TX       84U      /*!< GPDMA1 HW request is SPI3_TX        */
#define LL_GPDMA1_REQUEST_SPI4_RX       85U      /*!< GPDMA1 HW request is SPI4_RX        */
#define LL_GPDMA1_REQUEST_SPI4_TX       86U      /*!< GPDMA1 HW request is SPI4_TX        */
#define LL_GPDMA1_REQUEST_SPI5_RX       87U      /*!< GPDMA1 HW request is SPI5_RX        */
#define LL_GPDMA1_REQUEST_SPI5_TX       88U      /*!< GPDMA1 HW request is SPI5_TX        */
#define LL_GPDMA1_REQUEST_SPI6_RX       89U      /*!< GPDMA1 HW request is SPI6_RX        */
#define LL_GPDMA1_REQUEST_SPI6_TX       90U      /*!< GPDMA1 HW request is SPI6_TX        */

#define LL_GPDMA1_REQUEST_SAI1_A        91U      /*!< GPDMA1 HW request is SAI1_A         */
#define LL_GPDMA1_REQUEST_SAI1_B        92U      /*!< GPDMA1 HW request is SAI1_B         */
#define LL_GPDMA1_REQUEST_SAI2_A        93U      /*!< GPDMA1 HW request is SAI2_A         */
#define LL_GPDMA1_REQUEST_SAI2_B        94U      /*!< GPDMA1 HW request is SAI2_B         */

#define LL_GPDMA1_REQUEST_I2C1_RX       95U      /*!< GPDMA1 HW request is I2C1_RX        */
#define LL_GPDMA1_REQUEST_I2C1_TX       96U      /*!< GPDMA1 HW request is I2C1_TX        */
#define LL_GPDMA1_REQUEST_I2C2_RX       97U      /*!< GPDMA1 HW request is I2C2_RX        */
#define LL_GPDMA1_REQUEST_I2C2_TX       98U      /*!< GPDMA1 HW request is I2C2_TX        */
#define LL_GPDMA1_REQUEST_I2C3_RX       99U      /*!< GPDMA1 HW request is I2C3_RX        */
#define LL_GPDMA1_REQUEST_I2C3_TX       100U     /*!< GPDMA1 HW request is I2C3_TX        */

#define LL_GPDMA1_REQUEST_I2C4_RX       101U     /*!< GPDMA1 HW request is I2C4_RX        */
#define LL_GPDMA1_REQUEST_I2C4_TX       102U     /*!< GPDMA1 HW request is I2C4_TX        */

#define LL_GPDMA1_REQUEST_I3C1_RX       103U     /*!< GPDMA1 HW request is I3C1_RX        */
#define LL_GPDMA1_REQUEST_I3C1_TX       104U     /*!< GPDMA1 HW request is I3C1_TX        */
#define LL_GPDMA1_REQUEST_I3C2_RX       105U     /*!< GPDMA1 HW request is I3C2_RX        */
#define LL_GPDMA1_REQUEST_I3C2_TX       106U     /*!< GPDMA1 HW request is I3C2_TX        */

#define LL_GPDMA1_REQUEST_USART1_RX     107U     /*!< GPDMA1 HW request is USART1_RX      */
#define LL_GPDMA1_REQUEST_USART1_TX     108U     /*!< GPDMA1 HW request is USART1_TX      */
#define LL_GPDMA1_REQUEST_USART2_RX     109U     /*!< GPDMA1 HW request is USART2_RX      */
#define LL_GPDMA1_REQUEST_USART2_TX     110U     /*!< GPDMA1 HW request is USART2_TX      */
#define LL_GPDMA1_REQUEST_USART3_RX     111U     /*!< GPDMA1 HW request is USART3_RX      */
#define LL_GPDMA1_REQUEST_USART3_TX     112U     /*!< GPDMA1 HW request is USART3_TX      */
#define LL_GPDMA1_REQUEST_UART4_RX      113U     /*!< GPDMA1 HW request is UART4_RX       */
#define LL_GPDMA1_REQUEST_UART4_TX      114U     /*!< GPDMA1 HW request is UART4_TX       */
#define LL_GPDMA1_REQUEST_UART5_RX      115U     /*!< GPDMA1 HW request is UART5_RX       */
#define LL_GPDMA1_REQUEST_UART5_TX      116U     /*!< GPDMA1 HW request is UART5_TX       */
#define LL_GPDMA1_REQUEST_USART6_RX     117U     /*!< GPDMA1 HW request is USART6_RX      */
#define LL_GPDMA1_REQUEST_USART6_TX     118U     /*!< GPDMA1 HW request is USART6_TX      */
#define LL_GPDMA1_REQUEST_UART7_RX      119U     /*!< GPDMA1 HW request is UART7_RX       */
#define LL_GPDMA1_REQUEST_UART7_TX      120U     /*!< GPDMA1 HW request is UART7_TX       */
#define LL_GPDMA1_REQUEST_UART8_RX      121U     /*!< GPDMA1 HW request is UART8_RX       */
#define LL_GPDMA1_REQUEST_UART8_TX      122U     /*!< GPDMA1 HW request is UART8_TX       */
#define LL_GPDMA1_REQUEST_UART9_RX      123U     /*!< GPDMA1 HW request is UART9_RX       */
#define LL_GPDMA1_REQUEST_UART9_TX      124U     /*!< GPDMA1 HW request is UART9_TX       */
#define LL_GPDMA1_REQUEST_USART10_RX    125U     /*!< GPDMA1 HW request is USART10_RX     */
#define LL_GPDMA1_REQUEST_USART10_TX    126U     /*!< GPDMA1 HW request is USART10_TX     */

#define LL_GPDMA1_REQUEST_LPUART1_RX    127U     /*!< GPDMA1 HW request is LPUART1_RX     */
#define LL_GPDMA1_REQUEST_LPUART1_TX    128U     /*!< GPDMA1 HW request is LPUART1_TX     */

#define LL_GPDMA1_REQUEST_SPDIFRX_CS    129U     /*!< GPDMA1 HW request is SPDIFRX_CS     */
#define LL_GPDMA1_REQUEST_SPDIFRX_DT    130U     /*!< GPDMA1 HW request is SPDIFRX_DT     */

#define LL_GPDMA1_REQUEST_ADF1_FLT0     131U     /*!< GPDMA1 HW request is ADF1_FLT0      */

