micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_ll_dma.h
#define LL_GPDMA1_REQUEST_MDF1_FLT0     132U     /*!< GPDMA1 HW request is MDF1_FLT0      */
#define LL_GPDMA1_REQUEST_MDF1_FLT1     133U     /*!< GPDMA1 HW request is MDF1_FLT1      */
#define LL_GPDMA1_REQUEST_MDF1_FLT2     134U     /*!< GPDMA1 HW request is MDF1_FLT2      */
#define LL_GPDMA1_REQUEST_MDF1_FLT3     135U     /*!< GPDMA1 HW request is MDF1_FLT3      */
#define LL_GPDMA1_REQUEST_MDF1_FLT4     136U     /*!< GPDMA1 HW request is MDF1_FLT4      */
#define LL_GPDMA1_REQUEST_MDF1_FLT5     137U     /*!< GPDMA1 HW request is MDF1_FLT5      */

#define LL_GPDMA1_REQUEST_UCPD1_TX      138U     /*!< GPDMA1 HW request is UCPD1_TX       */
#define LL_GPDMA1_REQUEST_UCPD1_RX      139U     /*!< GPDMA1 HW request is UCPD1_RX       */

#define LL_GPDMA1_REQUEST_DCMI_PSSI     140U     /*!< GPDMA1 HW request is DCMI_PSSI      */

#define LL_GPDMA1_REQUEST_I3C1_TC       141U     /*!< GPDMA1 HW request is I3C1_TC        */
#define LL_GPDMA1_REQUEST_I3C1_RS       142U     /*!< GPDMA1 HW request is I3C1_RS        */

#define LL_GPDMA1_REQUEST_I3C2_TC       143U     /*!< GPDMA1 HW request is I3C2_TC        */
#define LL_GPDMA1_REQUEST_I3C2_RS       144U     /*!< GPDMA1 HW request is I3C2_RS        */

/**
  * @}
  */

/** @defgroup DMA_LL_EC_TRIGGER_SELECTION Trigger Selection
  * @{
  */
/* HPDMA1 triggers */
#define LL_HPDMA1_TRIGGER_DCMIPP_P0_FEND           0U   /*!< HPDMA1 HW Trigger signal is DCMIPP_P0_FEND           */
#define LL_HPDMA1_TRIGGER_DCMIPP_P0_LEND           1U   /*!< HPDMA1 HW Trigger signal is DCMIPP_P0_LEND           */
#define LL_HPDMA1_TRIGGER_DCMIPP_P0_HSYNC          2U   /*!< HPDMA1 HW Trigger signal is DCMIPP_P0_HSYNC          */
#define LL_HPDMA1_TRIGGER_DCMIPP_P0_VSYNC          3U   /*!< HPDMA1 HW Trigger signal is DCMIPP_P0_VSYNC          */

#define LL_HPDMA1_TRIGGER_DCMIPP_P1_FEND           4U   /*!< HPDMA1 HW Trigger signal is DCMIPP_P1_FEND           */
#define LL_HPDMA1_TRIGGER_DCMIPP_P1_LEND           5U   /*!< HPDMA1 HW Trigger signal is DCMIPP_P1_LEND           */
#define LL_HPDMA1_TRIGGER_DCMIPP_P1_HSYNC          6U   /*!< HPDMA1 HW Trigger signal is DCMIPP_P1_HSYNC          */
#define LL_HPDMA1_TRIGGER_DCMIPP_P1_VSYNC          7U   /*!< HPDMA1 HW Trigger signal is DCMIPP_P1_VSYNC          */

#define LL_HPDMA1_TRIGGER_DCMIPP_P2_FEND           8U   /*!< HPDMA1 HW Trigger signal is DCMIPP_P2_FEND           */
#define LL_HPDMA1_TRIGGER_DCMIPP_P2_LEND           9U   /*!< HPDMA1 HW Trigger signal is DCMIPP_P2_LEND           */
#define LL_HPDMA1_TRIGGER_DCMIPP_P2_HSYNC          10U  /*!< HPDMA1 HW Trigger signal is DCMIPP_P2_HSYNC          */
#define LL_HPDMA1_TRIGGER_DCMIPP_P2_VSYNC          11U  /*!< HPDMA1 HW Trigger signal is DCMIPP_P2_VSYNC          */

#define LL_HPDMA1_TRIGGER_DMA2D_CTC                12U  /*!< HPDMA1 HW Trigger signal is DMA2D_CTC                */
#define LL_HPDMA1_TRIGGER_DMA2D_TC                 13U  /*!< HPDMA1 HW Trigger signal is DMA2D_TC                 */
#define LL_HPDMA1_TRIGGER_DMA2D_TW                 14U  /*!< HPDMA1 HW Trigger signal is DMA2D_TW                 */

#define LL_HPDMA1_TRIGGER_JPEG_EOC                 15U  /*!< HPDMA1 HW Trigger signal is JPEG_EOC                 */
#define LL_HPDMA1_TRIGGER_JPEG_IFNF                16U  /*!< HPDMA1 HW Trigger signal is JPEG_IFNF                */
#define LL_HPDMA1_TRIGGER_JPEG_IFT                 17U  /*!< HPDMA1 HW Trigger signal is JPEG_IFT                 */
#define LL_HPDMA1_TRIGGER_JPEG_OFNE                18U  /*!< HPDMA1 HW Trigger signal is JPEG_OFNE                */
#define LL_HPDMA1_TRIGGER_JPEG_OFT                 19U  /*!< HPDMA1 HW Trigger signal is JPEG_OFT                 */

#define LL_HPDMA1_TRIGGER_LCD_LI                   20U  /*!< HPDMA1 HW Trigger signal is LCD_LI                   */

#define LL_HPDMA1_TRIGGER_GPU2D1_GP_0              21U  /*!< HPDMA1 HW Trigger signal is GPU2D1_GP_0              */
#define LL_HPDMA1_TRIGGER_GPU2D1_GP_1              22U  /*!< HPDMA1 HW Trigger signal is GPU2D1_GP_1              */
#define LL_HPDMA1_TRIGGER_GPU2D1_GP_2              23U  /*!< HPDMA1 HW Trigger signal is GPU2D1_GP_2              */
#define LL_HPDMA1_TRIGGER_GPU2D1_GP_3              24U  /*!< HPDMA1 HW Trigger signal is GPU2D1_GP_3              */

#define LL_HPDMA1_TRIGGER_GFXTIM_3                 25U  /*!< HPDMA1 HW Trigger signal is GFXTIM_3                 */
#define LL_HPDMA1_TRIGGER_GFXTIM_2                 26U  /*!< HPDMA1 HW Trigger signal is GFXTIM_2                 */
#define LL_HPDMA1_TRIGGER_GFXTIM_1                 27U  /*!< HPDMA1 HW Trigger signal is GFXTIM_1                 */
#define LL_HPDMA1_TRIGGER_GFXTIM_0                 28U  /*!< HPDMA1 HW Trigger signal is GFXTIM_0                 */

/* reserved                                        29U                                                            */

#define LL_HPDMA1_TRIGGER_LPTIM1_CH1               30U  /*!< HPDMA1 HW Trigger signal is LPTIM1_CH1               */
#define LL_HPDMA1_TRIGGER_LPTIM1_CH2               31U  /*!< HPDMA1 HW Trigger signal is LPTIM1_CH2               */
#define LL_HPDMA1_TRIGGER_LPTIM2_CH1               32U  /*!< HPDMA1 HW Trigger signal is LPTIM2_CH1               */
#define LL_HPDMA1_TRIGGER_LPTIM2_CH2               33U  /*!< HPDMA1 HW Trigger signal is LPTIM2_CH2               */
#define LL_HPDMA1_TRIGGER_LPTIM3_CH1               34U  /*!< HPDMA1 HW Trigger signal is LPTIM3_CH1               */
#define LL_HPDMA1_TRIGGER_LPTIM3_CH2               35U  /*!< HPDMA1 HW Trigger signal is LPTIM3_CH2               */
#define LL_HPDMA1_TRIGGER_LPTIM4_OUT               36U  /*!< HPDMA1 HW Trigger signal is LPTIM4_OUT               */
#define LL_HPDMA1_TRIGGER_LPTIM5_OUT               37U  /*!< HPDMA1 HW Trigger signal is LPTIM5_OUT               */

/* reserved                                        38U                                                            */

#define LL_HPDMA1_TRIGGER_RTC_WKUP                 39U  /*!< HPDMA1 HW Trigger signal is RTC_WKUP                 */

#define LL_HPDMA1_TRIGGER_LPUART1_IT_R_WUP_ASYNC   40U  /*!< HPDMA1 HW Trigger signal is IT_R_WUP_ASYNC           */
#define LL_HPDMA1_TRIGGER_LPUART1_IT_T_WUP_ASYNC   41U  /*!< HPDMA1 HW Trigger signal is IT_T_WUP_ASYNC           */

#define LL_HPDMA1_TRIGGER_SPI6_IT_OR_SPI6_AIT_SYNC 42U  /*!< HPDMA1 HW Trigger signal is SPI6_IT_OR_SPI6_AIT_SYNC */

/* reserved                                        43U                                                            */

