micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_ll_dma.h
#define LL_HPDMA1_TRIGGER_TIM1_TRGO                44U  /*!< HPDMA1 HW Trigger signal is TIM1_TRGO                */
#define LL_HPDMA1_TRIGGER_TIM1_TRGO2               45U  /*!< HPDMA1 HW Trigger signal is TIM1_TRGO2               */
#define LL_HPDMA1_TRIGGER_TIM2_TRGO                46U  /*!< HPDMA1 HW Trigger signal is TIM2_TRGO                */
#define LL_HPDMA1_TRIGGER_TIM3_TRGO                47U  /*!< HPDMA1 HW Trigger signal is TIM3_TRGO                */
#define LL_HPDMA1_TRIGGER_TIM4_TRGO                48U  /*!< HPDMA1 HW Trigger signal is TIM4_TRGO                */
#define LL_HPDMA1_TRIGGER_TIM5_TRGO                49U  /*!< HPDMA1 HW Trigger signal is TIM5_TRGO                */
#define LL_HPDMA1_TRIGGER_TIM6_TRGO                50U  /*!< HPDMA1 HW Trigger signal is TIM6_TRGO                */
#define LL_HPDMA1_TRIGGER_TIM7_TRGO                51U  /*!< HPDMA1 HW Trigger signal is TIM7_TRGO                */
#define LL_HPDMA1_TRIGGER_TIM8_TRGO                52U  /*!< HPDMA1 HW Trigger signal is TIM8_TRGO                */
#define LL_HPDMA1_TRIGGER_TIM8_TRGO2               53U  /*!< HPDMA1 HW Trigger signal is TIM8_TRGO2               */

/* reserved                                        54U                                                            */
/* reserved                                        55U                                                            */
/* reserved                                        56U                                                            */

#define LL_HPDMA1_TRIGGER_TIM12_TRGO               57U  /*!< HPDMA1 HW Trigger signal is TIM12_TRGO               */
#define LL_HPDMA1_TRIGGER_TIM15_TRGO               58U  /*!< HPDMA1 HW Trigger signal is TIM15_TRGO               */

/* reserved                                        59U                                                            */

#define LL_HPDMA1_TRIGGER_HPDMA1_CH0_TCF           60U  /*!< HPDMA1 HW Trigger signal is HPDMA1_CH0_TCF           */
#define LL_HPDMA1_TRIGGER_HPDMA1_CH1_TCF           61U  /*!< HPDMA1 HW Trigger signal is HPDMA1_CH1_TCF           */
#define LL_HPDMA1_TRIGGER_HPDMA1_CH2_TCF           62U  /*!< HPDMA1 HW Trigger signal is HPDMA1_CH2_TCF           */
#define LL_HPDMA1_TRIGGER_HPDMA1_CH3_TCF           63U  /*!< HPDMA1 HW Trigger signal is HPDMA1_CH3_TCF           */
#define LL_HPDMA1_TRIGGER_HPDMA1_CH4_TCF           64U  /*!< HPDMA1 HW Trigger signal is HPDMA1_CH4_TCF           */
#define LL_HPDMA1_TRIGGER_HPDMA1_CH5_TCF           65U  /*!< HPDMA1 HW Trigger signal is HPDMA1_CH5_TCF           */
#define LL_HPDMA1_TRIGGER_HPDMA1_CH6_TCF           66U  /*!< HPDMA1 HW Trigger signal is HPDMA1_CH6_TCF           */
#define LL_HPDMA1_TRIGGER_HPDMA1_CH7_TCF           67U  /*!< HPDMA1 HW Trigger signal is HPDMA1_CH7_TCF           */
#define LL_HPDMA1_TRIGGER_HPDMA1_CH8_TCF           68U  /*!< HPDMA1 HW Trigger signal is HPDMA1_CH8_TCF           */
#define LL_HPDMA1_TRIGGER_HPDMA1_CH9_TCF           69U  /*!< HPDMA1 HW Trigger signal is HPDMA1_CH9_TCF           */
#define LL_HPDMA1_TRIGGER_HPDMA1_CH10_TCF          70U  /*!< HPDMA1 HW Trigger signal is HPDMA1_CH10_TCF          */
#define LL_HPDMA1_TRIGGER_HPDMA1_CH11_TCF          71U  /*!< HPDMA1 HW Trigger signal is HPDMA1_CH11_TCF          */
#define LL_HPDMA1_TRIGGER_HPDMA1_CH12_TCF          72U  /*!< HPDMA1 HW Trigger signal is HPDMA1_CH12_TCF          */
#define LL_HPDMA1_TRIGGER_HPDMA1_CH13_TCF          73U  /*!< HPDMA1 HW Trigger signal is HPDMA1_CH13_TCF          */
#define LL_HPDMA1_TRIGGER_HPDMA1_CH14_TCF          74U  /*!< HPDMA1 HW Trigger signal is HPDMA1_CH14_TCF          */
#define LL_HPDMA1_TRIGGER_HPDMA1_CH15_TCF          75U  /*!< HPDMA1 HW Trigger signal is HPDMA1_CH15_TCF          */

#define LL_HPDMA1_TRIGGER_GPDMA1_CH0_TCF           76U  /*!< HPDMA1 HW Trigger signal is GPDMA1_CH0_TCF           */
#define LL_HPDMA1_TRIGGER_GPDMA1_CH1_TCF           77U  /*!< HPDMA1 HW Trigger signal is GPDMA1_CH1_TCF           */
#define LL_HPDMA1_TRIGGER_GPDMA1_CH2_TCF           78U  /*!< HPDMA1 HW Trigger signal is GPDMA1_CH2_TCF           */
#define LL_HPDMA1_TRIGGER_GPDMA1_CH3_TCF           79U  /*!< HPDMA1 HW Trigger signal is GPDMA1_CH3_TCF           */
#define LL_HPDMA1_TRIGGER_GPDMA1_CH4_TCF           80U  /*!< HPDMA1 HW Trigger signal is GPDMA1_CH4_TCF           */
#define LL_HPDMA1_TRIGGER_GPDMA1_CH5_TCF           81U  /*!< HPDMA1 HW Trigger signal is GPDMA1_CH5_TCF           */
#define LL_HPDMA1_TRIGGER_GPDMA1_CH6_TCF           82U  /*!< HPDMA1 HW Trigger signal is GPDMA1_CH6_TCF           */
#define LL_HPDMA1_TRIGGER_GPDMA1_CH7_TCF           83U  /*!< HPDMA1 HW Trigger signal is GPDMA1_CH7_TCF           */
#define LL_HPDMA1_TRIGGER_GPDMA1_CH8_TCF           84U  /*!< HPDMA1 HW Trigger signal is GPDMA1_CH8_TCF           */
#define LL_HPDMA1_TRIGGER_GPDMA1_CH9_TCF           85U  /*!< HPDMA1 HW Trigger signal is GPDMA1_CH9_TCF           */
#define LL_HPDMA1_TRIGGER_GPDMA1_CH10_TCF          86U  /*!< HPDMA1 HW Trigger signal is GPDMA1_CH10_TCF          */
#define LL_HPDMA1_TRIGGER_GPDMA1_CH11_TCF          87U  /*!< HPDMA1 HW Trigger signal is GPDMA1_CH11_TCF          */
#define LL_HPDMA1_TRIGGER_GPDMA1_CH12_TCF          88U  /*!< HPDMA1 HW Trigger signal is GPDMA1_CH12_TCF          */
#define LL_HPDMA1_TRIGGER_GPDMA1_CH13_TCF          89U  /*!< HPDMA1 HW Trigger signal is GPDMA1_CH13_TCF          */
#define LL_HPDMA1_TRIGGER_GPDMA1_CH14_TCF          90U  /*!< HPDMA1 HW Trigger signal is GPDMA1_CH14_TCF          */
#define LL_HPDMA1_TRIGGER_GPDMA1_CH15_TCF          91U  /*!< HPDMA1 HW Trigger signal is GPDMA1_CH15_TCF          */

/* reserved                                        92U                                                            */

#define LL_HPDMA1_TRIGGER_EXTIT0_SYNC              93U  /*!< HPDMA1 HW Trigger signal is EXTIT0_SYNC              */
#define LL_HPDMA1_TRIGGER_EXTIT1_SYNC              94U  /*!< HPDMA1 HW Trigger signal is EXTIT1_SYNC              */
#define LL_HPDMA1_TRIGGER_EXTIT2_SYNC              95U  /*!< HPDMA1 HW Trigger signal is EXTIT2_SYNC              */
#define LL_HPDMA1_TRIGGER_EXTIT3_SYNC              96U  /*!< HPDMA1 HW Trigger signal is EXTIT3_SYNC              */
#define LL_HPDMA1_TRIGGER_EXTIT4_SYNC              97U  /*!< HPDMA1 HW Trigger signal is EXTIT4_SYNC              */
#define LL_HPDMA1_TRIGGER_EXTIT5_SYNC              98U  /*!< HPDMA1 HW Trigger signal is EXTIT5_SYNC              */
#define LL_HPDMA1_TRIGGER_EXTIT6_SYNC              99U  /*!< HPDMA1 HW Trigger signal is EXTIT6_SYNC              */
#define LL_HPDMA1_TRIGGER_EXTIT7_SYNC              100U /*!< HPDMA1 HW Trigger signal is EXTIT7_SYNC              */
#define LL_HPDMA1_TRIGGER_EXTIT8_SYNC              101U /*!< HPDMA1 HW Trigger signal is EXTIT8_SYNC              */
#define LL_HPDMA1_TRIGGER_EXTIT9_SYNC              102U /*!< HPDMA1 HW Trigger signal is EXTIT9_SYNC              */
#define LL_HPDMA1_TRIGGER_EXTIT10_SYNC             103U /*!< HPDMA1 HW Trigger signal is EXTIT10_SYNC             */
#define LL_HPDMA1_TRIGGER_EXTIT11_SYNC             104U /*!< HPDMA1 HW Trigger signal is EXTIT11_SYNC             */
#define LL_HPDMA1_TRIGGER_EXTIT12_SYNC             105U /*!< HPDMA1 HW Trigger signal is EXTIT12_SYNC             */
#define LL_HPDMA1_TRIGGER_EXTIT13_SYNC             106U /*!< HPDMA1 HW Trigger signal is EXTIT13_SYNC             */
#define LL_HPDMA1_TRIGGER_EXTIT14_SYNC             107U /*!< HPDMA1 HW Trigger signal is EXTIT14_SYNC             */
#define LL_HPDMA1_TRIGGER_EXTIT15_SYNC             108U /*!< HPDMA1 HW Trigger signal is EXTIT15_SYNC             */


/* GPDMA1 triggers */
#define LL_GPDMA1_TRIGGER_DCMIPP_P0_FEND           0U   /*!< GPDMA1 HW Trigger signal is DCMIPP_P0_FEND           */
#define LL_GPDMA1_TRIGGER_DCMIPP_P0_LEND           1U   /*!< GPDMA1 HW Trigger signal is DCMIPP_P0_LEND           */
#define LL_GPDMA1_TRIGGER_DCMIPP_P0_HSYNC          2U   /*!< GPDMA1 HW Trigger signal is DCMIPP_P0_HSYNC          */
#define LL_GPDMA1_TRIGGER_DCMIPP_P0_VSYNC          3U   /*!< GPDMA1 HW Trigger signal is DCMIPP_P0_VSYNC          */

#define LL_GPDMA1_TRIGGER_DCMIPP_P1_FEND           4U   /*!< GPDMA1 HW Trigger signal is DCMIPP_P1_FEND           */
#define LL_GPDMA1_TRIGGER_DCMIPP_P1_LEND           5U   /*!< GPDMA1 HW Trigger signal is DCMIPP_P1_LEND           */
#define LL_GPDMA1_TRIGGER_DCMIPP_P1_HSYNC          6U   /*!< GPDMA1 HW Trigger signal is DCMIPP_P1_HSYNC          */
#define LL_GPDMA1_TRIGGER_DCMIPP_P1_VSYNC          7U   /*!< GPDMA1 HW Trigger signal is DCMIPP_P1_VSYNC          */

