micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_ll_dma.h
#define LL_GPDMA1_TRIGGER_DCMIPP_P2_FEND           8U   /*!< GPDMA1 HW Trigger signal is DCMIPP_P2_FEND           */
#define LL_GPDMA1_TRIGGER_DCMIPP_P2_LEND           9U   /*!< GPDMA1 HW Trigger signal is DCMIPP_P2_LEND           */
#define LL_GPDMA1_TRIGGER_DCMIPP_P2_HSYNC          10U  /*!< GPDMA1 HW Trigger signal is DCMIPP_P2_HSYNC          */
#define LL_GPDMA1_TRIGGER_DCMIPP_P2_VSYNC          11U  /*!< GPDMA1 HW Trigger signal is DCMIPP_P2_VSYNC          */

#define LL_GPDMA1_TRIGGER_DMA2D_CTC                12U  /*!< GPDMA1 HW Trigger signal is DMA2D_CTC                */
#define LL_GPDMA1_TRIGGER_DMA2D_TC                 13U  /*!< GPDMA1 HW Trigger signal is DMA2D_TC                 */
#define LL_GPDMA1_TRIGGER_DMA2D_TW                 14U  /*!< GPDMA1 HW Trigger signal is DMA2D_TW                 */

#define LL_GPDMA1_TRIGGER_JPEG_EOC                 15U  /*!< GPDMA1 HW Trigger signal is JPEG_EOC                 */
#define LL_GPDMA1_TRIGGER_JPEG_IFNF                16U  /*!< GPDMA1 HW Trigger signal is JPEG_IFNF                */
#define LL_GPDMA1_TRIGGER_JPEG_IFT                 17U  /*!< GPDMA1 HW Trigger signal is JPEG_IFT                 */
#define LL_GPDMA1_TRIGGER_JPEG_OFNE                18U  /*!< GPDMA1 HW Trigger signal is JPEG_OFNE                */
#define LL_GPDMA1_TRIGGER_JPEG_OFT                 19U  /*!< GPDMA1 HW Trigger signal is JPEG_OFT                 */

#define LL_GPDMA1_TRIGGER_LCD_LI                   20U  /*!< GPDMA1 HW Trigger signal is LCD_LI                   */

#define LL_GPDMA1_TRIGGER_GPU2D1_GP_0              21U  /*!< GPDMA1 HW Trigger signal is GPU2D1_GP_0              */
#define LL_GPDMA1_TRIGGER_GPU2D1_GP_1              22U  /*!< GPDMA1 HW Trigger signal is GPU2D1_GP_1              */
#define LL_GPDMA1_TRIGGER_GPU2D1_GP_2              23U  /*!< GPDMA1 HW Trigger signal is GPU2D1_GP_2              */
#define LL_GPDMA1_TRIGGER_GPU2D1_GP_3              24U  /*!< GPDMA1 HW Trigger signal is GPU2D1_GP_3              */

#define LL_GPDMA1_TRIGGER_GFXTIM_3                 25U  /*!< GPDMA1 HW Trigger signal is GFXTIM_3                 */
#define LL_GPDMA1_TRIGGER_GFXTIM_2                 26U  /*!< GPDMA1 HW Trigger signal is GFXTIM_2                 */
#define LL_GPDMA1_TRIGGER_GFXTIM_1                 27U  /*!< GPDMA1 HW Trigger signal is GFXTIM_1                 */
#define LL_GPDMA1_TRIGGER_GFXTIM_0                 28U  /*!< GPDMA1 HW Trigger signal is GFXTIM_0                 */

/* reserved                                        29U                                                            */

#define LL_GPDMA1_TRIGGER_LPTIM1_CH1               30U  /*!< GPDMA1 HW Trigger signal is LPTIM1_CH1               */
#define LL_GPDMA1_TRIGGER_LPTIM1_CH2               31U  /*!< GPDMA1 HW Trigger signal is LPTIM1_CH2               */
#define LL_GPDMA1_TRIGGER_LPTIM2_CH1               32U  /*!< GPDMA1 HW Trigger signal is LPTIM2_CH1               */
#define LL_GPDMA1_TRIGGER_LPTIM2_CH2               33U  /*!< GPDMA1 HW Trigger signal is LPTIM2_CH2               */
#define LL_GPDMA1_TRIGGER_LPTIM3_CH1               34U  /*!< GPDMA1 HW Trigger signal is LPTIM3_CH1               */
#define LL_GPDMA1_TRIGGER_LPTIM3_CH2               35U  /*!< GPDMA1 HW Trigger signal is LPTIM3_CH2               */
#define LL_GPDMA1_TRIGGER_LPTIM4_OUT               36U  /*!< GPDMA1 HW Trigger signal is LPTIM4_OUT               */
#define LL_GPDMA1_TRIGGER_LPTIM5_OUT               37U  /*!< GPDMA1 HW Trigger signal is LPTIM5_OUT               */

/* reserved                                        38U                                                            */

#define LL_GPDMA1_TRIGGER_RTC_WKUP                 39U  /*!< GPDMA1 HW Trigger signal is RTC_WKUP                 */

#define LL_GPDMA1_TRIGGER_LPUART1_IT_R_WUP_ASYNC   40U  /*!< GPDMA1 HW Trigger signal is IT_R_WUP_ASYNC           */
#define LL_GPDMA1_TRIGGER_LPUART1_IT_T_WUP_ASYNC   41U  /*!< GPDMA1 HW Trigger signal is IT_T_WUP_ASYNC           */

#define LL_GPDMA1_TRIGGER_SPI6_IT_OR_SPI6_AIT_SYNC 42U  /*!< GPDMA1 HW Trigger signal is SPI6_IT_OR_SPI6_AIT_SYNC */

/* reserved                                        43U                                                            */

#define LL_GPDMA1_TRIGGER_TIM1_TRGO                44U  /*!< GPDMA1 HW Trigger signal is TIM1_TRGO                */
#define LL_GPDMA1_TRIGGER_TIM1_TRGO2               45U  /*!< GPDMA1 HW Trigger signal is TIM1_TRGO2               */
#define LL_GPDMA1_TRIGGER_TIM2_TRGO                46U  /*!< GPDMA1 HW Trigger signal is TIM2_TRGO                */
#define LL_GPDMA1_TRIGGER_TIM3_TRGO                47U  /*!< GPDMA1 HW Trigger signal is TIM3_TRGO                */
#define LL_GPDMA1_TRIGGER_TIM4_TRGO                48U  /*!< GPDMA1 HW Trigger signal is TIM4_TRGO                */
#define LL_GPDMA1_TRIGGER_TIM5_TRGO                49U  /*!< GPDMA1 HW Trigger signal is TIM5_TRGO                */
#define LL_GPDMA1_TRIGGER_TIM6_TRGO                50U  /*!< GPDMA1 HW Trigger signal is TIM6_TRGO                */
#define LL_GPDMA1_TRIGGER_TIM7_TRGO                51U  /*!< GPDMA1 HW Trigger signal is TIM7_TRGO                */
#define LL_GPDMA1_TRIGGER_TIM8_TRGO                52U  /*!< GPDMA1 HW Trigger signal is TIM8_TRGO                */
#define LL_GPDMA1_TRIGGER_TIM8_TRGO2               53U  /*!< GPDMA1 HW Trigger signal is TIM8_TRGO2               */

/* reserved                                        54U                                                            */
/* reserved                                        55U                                                            */
/* reserved                                        56U                                                            */

#define LL_GPDMA1_TRIGGER_TIM12_TRGO               57U  /*!< GPDMA1 HW Trigger signal is TIM12_TRGO               */
#define LL_GPDMA1_TRIGGER_TIM15_TRGO               58U  /*!< GPDMA1 HW Trigger signal is TIM15_TRGO               */

/* reserved                                        59U                                                            */

#define LL_GPDMA1_TRIGGER_HPDMA1_CH0_TCF           60U  /*!< GPDMA1 HW Trigger signal is HPDMA1_CH0_TCF           */
#define LL_GPDMA1_TRIGGER_HPDMA1_CH1_TCF           61U  /*!< GPDMA1 HW Trigger signal is HPDMA1_CH1_TCF           */
#define LL_GPDMA1_TRIGGER_HPDMA1_CH2_TCF           62U  /*!< GPDMA1 HW Trigger signal is HPDMA1_CH2_TCF           */
#define LL_GPDMA1_TRIGGER_HPDMA1_CH3_TCF           63U  /*!< GPDMA1 HW Trigger signal is HPDMA1_CH3_TCF           */
#define LL_GPDMA1_TRIGGER_HPDMA1_CH4_TCF           64U  /*!< GPDMA1 HW Trigger signal is HPDMA1_CH4_TCF           */
#define LL_GPDMA1_TRIGGER_HPDMA1_CH5_TCF           65U  /*!< GPDMA1 HW Trigger signal is HPDMA1_CH5_TCF           */
#define LL_GPDMA1_TRIGGER_HPDMA1_CH6_TCF           66U  /*!< GPDMA1 HW Trigger signal is HPDMA1_CH6_TCF           */
#define LL_GPDMA1_TRIGGER_HPDMA1_CH7_TCF           67U  /*!< GPDMA1 HW Trigger signal is HPDMA1_CH7_TCF           */
#define LL_GPDMA1_TRIGGER_HPDMA1_CH8_TCF           68U  /*!< GPDMA1 HW Trigger signal is HPDMA1_CH8_TCF           */
#define LL_GPDMA1_TRIGGER_HPDMA1_CH9_TCF           69U  /*!< GPDMA1 HW Trigger signal is HPDMA1_CH9_TCF           */
#define LL_GPDMA1_TRIGGER_HPDMA1_CH10_TCF          70U  /*!< GPDMA1 HW Trigger signal is HPDMA1_CH10_TCF          */
#define LL_GPDMA1_TRIGGER_HPDMA1_CH11_TCF          71U  /*!< GPDMA1 HW Trigger signal is HPDMA1_CH11_TCF          */
#define LL_GPDMA1_TRIGGER_HPDMA1_CH12_TCF          72U  /*!< GPDMA1 HW Trigger signal is HPDMA1_CH12_TCF          */
#define LL_GPDMA1_TRIGGER_HPDMA1_CH13_TCF          73U  /*!< GPDMA1 HW Trigger signal is HPDMA1_CH13_TCF          */
#define LL_GPDMA1_TRIGGER_HPDMA1_CH14_TCF          74U  /*!< GPDMA1 HW Trigger signal is HPDMA1_CH14_TCF          */
#define LL_GPDMA1_TRIGGER_HPDMA1_CH15_TCF          75U  /*!< GPDMA1 HW Trigger signal is HPDMA1_CH15_TCF          */

#define LL_GPDMA1_TRIGGER_GPDMA1_CH0_TCF           76U  /*!< GPDMA1 HW Trigger signal is GPDMA1_CH0_TCF           */
#define LL_GPDMA1_TRIGGER_GPDMA1_CH1_TCF           77U  /*!< GPDMA1 HW Trigger signal is GPDMA1_CH1_TCF           */
#define LL_GPDMA1_TRIGGER_GPDMA1_CH2_TCF           78U  /*!< GPDMA1 HW Trigger signal is GPDMA1_CH2_TCF           */
#define LL_GPDMA1_TRIGGER_GPDMA1_CH3_TCF           79U  /*!< GPDMA1 HW Trigger signal is GPDMA1_CH3_TCF           */
#define LL_GPDMA1_TRIGGER_GPDMA1_CH4_TCF           80U  /*!< GPDMA1 HW Trigger signal is GPDMA1_CH4_TCF           */
#define LL_GPDMA1_TRIGGER_GPDMA1_CH5_TCF           81U  /*!< GPDMA1 HW Trigger signal is GPDMA1_CH5_TCF           */
#define LL_GPDMA1_TRIGGER_GPDMA1_CH6_TCF           82U  /*!< GPDMA1 HW Trigger signal is GPDMA1_CH6_TCF           */
#define LL_GPDMA1_TRIGGER_GPDMA1_CH7_TCF           83U  /*!< GPDMA1 HW Trigger signal is GPDMA1_CH7_TCF           */
#define LL_GPDMA1_TRIGGER_GPDMA1_CH8_TCF           84U  /*!< GPDMA1 HW Trigger signal is GPDMA1_CH8_TCF           */
#define LL_GPDMA1_TRIGGER_GPDMA1_CH9_TCF           85U  /*!< GPDMA1 HW Trigger signal is GPDMA1_CH9_TCF           */
#define LL_GPDMA1_TRIGGER_GPDMA1_CH10_TCF          86U  /*!< GPDMA1 HW Trigger signal is GPDMA1_CH10_TCF          */
#define LL_GPDMA1_TRIGGER_GPDMA1_CH11_TCF          87U  /*!< GPDMA1 HW Trigger signal is GPDMA1_CH11_TCF          */
#define LL_GPDMA1_TRIGGER_GPDMA1_CH12_TCF          88U  /*!< GPDMA1 HW Trigger signal is GPDMA1_CH12_TCF          */
#define LL_GPDMA1_TRIGGER_GPDMA1_CH13_TCF          89U  /*!< GPDMA1 HW Trigger signal is GPDMA1_CH13_TCF          */
#define LL_GPDMA1_TRIGGER_GPDMA1_CH14_TCF          90U  /*!< GPDMA1 HW Trigger signal is GPDMA1_CH14_TCF          */
#define LL_GPDMA1_TRIGGER_GPDMA1_CH15_TCF          91U  /*!< GPDMA1 HW Trigger signal is GPDMA1_CH15_TCF          */

