micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_ll_dma.h
/**
  * @brief Set hardware trigger.
  * @note  This API is used for all available DMA channels.
  * @rmtoll CTR2         TRIGSEL     LL_DMA_SetHWTrigger
  * @param  DMAx DMAx Instance
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_DMA_CHANNEL_0
  *         @arg @ref LL_DMA_CHANNEL_1
  *         @arg @ref LL_DMA_CHANNEL_2
  *         @arg @ref LL_DMA_CHANNEL_3
  *         @arg @ref LL_DMA_CHANNEL_4
  *         @arg @ref LL_DMA_CHANNEL_5
  *         @arg @ref LL_DMA_CHANNEL_6
  *         @arg @ref LL_DMA_CHANNEL_7
  *         @arg @ref LL_DMA_CHANNEL_8
  *         @arg @ref LL_DMA_CHANNEL_9
  *         @arg @ref LL_DMA_CHANNEL_10
  *         @arg @ref LL_DMA_CHANNEL_11
  *         @arg @ref LL_DMA_CHANNEL_12
  *         @arg @ref LL_DMA_CHANNEL_13
  *         @arg @ref LL_DMA_CHANNEL_14
  *         @arg @ref LL_DMA_CHANNEL_15
  * @param  Trigger This parameter can be one of the following values:
  *         @arg @ref LL_HPDMA1_TRIGGER_DCMIPP_P0_FEND
  *         @arg @ref LL_HPDMA1_TRIGGER_DCMIPP_P0_LEND
  *         @arg @ref LL_HPDMA1_TRIGGER_DCMIPP_P0_HSYNC
  *         @arg @ref LL_HPDMA1_TRIGGER_DCMIPP_P0_VSYNC
  *         @arg @ref LL_HPDMA1_TRIGGER_DCMIPP_P1_FEND
  *         @arg @ref LL_HPDMA1_TRIGGER_DCMIPP_P1_LEND
  *         @arg @ref LL_HPDMA1_TRIGGER_DCMIPP_P1_HSYNC
  *         @arg @ref LL_HPDMA1_TRIGGER_DCMIPP_P1_VSYNC
  *         @arg @ref LL_HPDMA1_TRIGGER_DCMIPP_P2_FEND
  *         @arg @ref LL_HPDMA1_TRIGGER_DCMIPP_P2_LEND
  *         @arg @ref LL_HPDMA1_TRIGGER_DCMIPP_P2_HSYNC
  *         @arg @ref LL_HPDMA1_TRIGGER_DCMIPP_P2_VSYNC
  *         @arg @ref LL_HPDMA1_TRIGGER_DMA2D_CTC
  *         @arg @ref LL_HPDMA1_TRIGGER_DMA2D_TC
  *         @arg @ref LL_HPDMA1_TRIGGER_DMA2D_TW
  *         @arg @ref LL_HPDMA1_TRIGGER_JPEG_EOC
  *         @arg @ref LL_HPDMA1_TRIGGER_JPEG_IFNF
  *         @arg @ref LL_HPDMA1_TRIGGER_JPEG_IFT
  *         @arg @ref LL_HPDMA1_TRIGGER_JPEG_OFNE
  *         @arg @ref LL_HPDMA1_TRIGGER_JPEG_OFT
  *         @arg @ref LL_HPDMA1_TRIGGER_LCD_LI
  *         @arg @ref LL_HPDMA1_TRIGGER_GPU2D1_GP_0
  *         @arg @ref LL_HPDMA1_TRIGGER_GPU2D1_GP_1
  *         @arg @ref LL_HPDMA1_TRIGGER_GPU2D1_GP_2
  *         @arg @ref LL_HPDMA1_TRIGGER_GPU2D1_GP_3
  *         @arg @ref LL_HPDMA1_TRIGGER_GFXTIM_3
  *         @arg @ref LL_HPDMA1_TRIGGER_GFXTIM_2
  *         @arg @ref LL_HPDMA1_TRIGGER_GFXTIM_1
  *         @arg @ref LL_HPDMA1_TRIGGER_GFXTIM_0
  *         @arg @ref LL_HPDMA1_TRIGGER_LPTIM1_CH1
  *         @arg @ref LL_HPDMA1_TRIGGER_LPTIM1_CH2
  *         @arg @ref LL_HPDMA1_TRIGGER_LPTIM2_CH1
  *         @arg @ref LL_HPDMA1_TRIGGER_LPTIM2_CH2
  *         @arg @ref LL_HPDMA1_TRIGGER_LPTIM3_CH1
  *         @arg @ref LL_HPDMA1_TRIGGER_LPTIM3_CH2
  *         @arg @ref LL_HPDMA1_TRIGGER_LPTIM4_OUT
  *         @arg @ref LL_HPDMA1_TRIGGER_LPTIM5_OUT
  *         @arg @ref LL_HPDMA1_TRIGGER_RTC_WKUP
  *         @arg @ref LL_HPDMA1_TRIGGER_LPUART1_IT_R_WUP_ASYNC
  *         @arg @ref LL_HPDMA1_TRIGGER_LPUART1_IT_T_WUP_ASYNC
  *         @arg @ref LL_HPDMA1_TRIGGER_SPI6_IT_OR_SPI6_AIT_SYNC
  *         @arg @ref LL_HPDMA1_TRIGGER_TIM1_TRGO
  *         @arg @ref LL_HPDMA1_TRIGGER_TIM1_TRGO2
  *         @arg @ref LL_HPDMA1_TRIGGER_TIM2_TRGO
  *         @arg @ref LL_HPDMA1_TRIGGER_TIM3_TRGO
  *         @arg @ref LL_HPDMA1_TRIGGER_TIM4_TRGO
  *         @arg @ref LL_HPDMA1_TRIGGER_TIM5_TRGO
  *         @arg @ref LL_HPDMA1_TRIGGER_TIM6_TRGO
  *         @arg @ref LL_HPDMA1_TRIGGER_TIM7_TRGO
  *         @arg @ref LL_HPDMA1_TRIGGER_TIM8_TRGO
  *         @arg @ref LL_HPDMA1_TRIGGER_TIM8_TRGO2
  *         @arg @ref LL_HPDMA1_TRIGGER_TIM12_TRGO
  *         @arg @ref LL_HPDMA1_TRIGGER_TIM15_TRGO
  *         @arg @ref LL_HPDMA1_TRIGGER_HPDMA1_CH0_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_HPDMA1_CH1_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_HPDMA1_CH2_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_HPDMA1_CH3_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_HPDMA1_CH4_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_HPDMA1_CH5_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_HPDMA1_CH6_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_HPDMA1_CH7_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_HPDMA1_CH8_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_HPDMA1_CH9_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_HPDMA1_CH10_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_HPDMA1_CH11_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_HPDMA1_CH12_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_HPDMA1_CH13_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_HPDMA1_CH14_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_HPDMA1_CH15_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_GPDMA1_CH0_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_GPDMA1_CH1_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_GPDMA1_CH2_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_GPDMA1_CH3_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_GPDMA1_CH4_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_GPDMA1_CH5_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_GPDMA1_CH6_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_GPDMA1_CH7_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_GPDMA1_CH8_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_GPDMA1_CH9_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_GPDMA1_CH10_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_GPDMA1_CH11_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_GPDMA1_CH12_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_GPDMA1_CH13_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_GPDMA1_CH14_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_GPDMA1_CH15_TCF
  *         @arg @ref LL_HPDMA1_TRIGGER_EXTIT0_SYNC
  *         @arg @ref LL_HPDMA1_TRIGGER_EXTIT1_SYNC
  *         @arg @ref LL_HPDMA1_TRIGGER_EXTIT2_SYNC
  *         @arg @ref LL_HPDMA1_TRIGGER_EXTIT3_SYNC
  *         @arg @ref LL_HPDMA1_TRIGGER_EXTIT4_SYNC
  *         @arg @ref LL_HPDMA1_TRIGGER_EXTIT5_SYNC
  *         @arg @ref LL_HPDMA1_TRIGGER_EXTIT6_SYNC
  *         @arg @ref LL_HPDMA1_TRIGGER_EXTIT7_SYNC
  *         @arg @ref LL_HPDMA1_TRIGGER_EXTIT8_SYNC
  *         @arg @ref LL_HPDMA1_TRIGGER_EXTIT9_SYNC
  *         @arg @ref LL_HPDMA1_TRIGGER_EXTIT10_SYNC
  *         @arg @ref LL_HPDMA1_TRIGGER_EXTIT11_SYNC
  *         @arg @ref LL_HPDMA1_TRIGGER_EXTIT12_SYNC
  *         @arg @ref LL_HPDMA1_TRIGGER_EXTIT13_SYNC
  *         @arg @ref LL_HPDMA1_TRIGGER_EXTIT14_SYNC
  *         @arg @ref LL_HPDMA1_TRIGGER_EXTIT15_SYNC
  *         @arg @ref LL_GPDMA1_TRIGGER_DCMIPP_P0_FEND
  *         @arg @ref LL_GPDMA1_TRIGGER_DCMIPP_P0_LEND
  *         @arg @ref LL_GPDMA1_TRIGGER_DCMIPP_P0_HSYNC
  *         @arg @ref LL_GPDMA1_TRIGGER_DCMIPP_P0_VSYNC
  *         @arg @ref LL_GPDMA1_TRIGGER_DCMIPP_P1_FEND
  *         @arg @ref LL_GPDMA1_TRIGGER_DCMIPP_P1_LEND
  *         @arg @ref LL_GPDMA1_TRIGGER_DCMIPP_P1_HSYNC
  *         @arg @ref LL_GPDMA1_TRIGGER_DCMIPP_P1_VSYNC
  *         @arg @ref LL_GPDMA1_TRIGGER_DCMIPP_P2_FEND
  *         @arg @ref LL_GPDMA1_TRIGGER_DCMIPP_P2_LEND
  *         @arg @ref LL_GPDMA1_TRIGGER_DCMIPP_P2_HSYNC
  *         @arg @ref LL_GPDMA1_TRIGGER_DCMIPP_P2_VSYNC
  *         @arg @ref LL_GPDMA1_TRIGGER_DMA2D_CTC
  *         @arg @ref LL_GPDMA1_TRIGGER_DMA2D_TC
  *         @arg @ref LL_GPDMA1_TRIGGER_DMA2D_TW
  *         @arg @ref LL_GPDMA1_TRIGGER_JPEG_EOC
  *         @arg @ref LL_GPDMA1_TRIGGER_JPEG_IFNF
  *         @arg @ref LL_GPDMA1_TRIGGER_JPEG_IFT
  *         @arg @ref LL_GPDMA1_TRIGGER_JPEG_OFNE
  *         @arg @ref LL_GPDMA1_TRIGGER_JPEG_OFT
  *         @arg @ref LL_GPDMA1_TRIGGER_LCD_LI
  *         @arg @ref LL_GPDMA1_TRIGGER_GPU2D1_GP_0
  *         @arg @ref LL_GPDMA1_TRIGGER_GPU2D1_GP_1
  *         @arg @ref LL_GPDMA1_TRIGGER_GPU2D1_GP_2
  *         @arg @ref LL_GPDMA1_TRIGGER_GPU2D1_GP_3
  *         @arg @ref LL_GPDMA1_TRIGGER_GFXTIM_3
  *         @arg @ref LL_GPDMA1_TRIGGER_GFXTIM_2
  *         @arg @ref LL_GPDMA1_TRIGGER_GFXTIM_1
  *         @arg @ref LL_GPDMA1_TRIGGER_GFXTIM_0
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM1_CH1
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM1_CH2
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM2_CH1
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM2_CH2
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM3_CH1
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM3_CH2
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM4_OUT
  *         @arg @ref LL_GPDMA1_TRIGGER_LPTIM5_OUT
  *         @arg @ref LL_GPDMA1_TRIGGER_RTC_WKUP
  *         @arg @ref LL_GPDMA1_TRIGGER_LPUART1_IT_R_WUP_ASYNC
  *         @arg @ref LL_GPDMA1_TRIGGER_LPUART1_IT_T_WUP_ASYNC
  *         @arg @ref LL_GPDMA1_TRIGGER_SPI6_IT_OR_SPI6_AIT_SYNC
  *         @arg @ref LL_GPDMA1_TRIGGER_TIM1_TRGO
  *         @arg @ref LL_GPDMA1_TRIGGER_TIM1_TRGO2
  *         @arg @ref LL_GPDMA1_TRIGGER_TIM2_TRGO
  *         @arg @ref LL_GPDMA1_TRIGGER_TIM3_TRGO
  *         @arg @ref LL_GPDMA1_TRIGGER_TIM4_TRGO
  *         @arg @ref LL_GPDMA1_TRIGGER_TIM5_TRGO
  *         @arg @ref LL_GPDMA1_TRIGGER_TIM6_TRGO
  *         @arg @ref LL_GPDMA1_TRIGGER_TIM7_TRGO
  *         @arg @ref LL_GPDMA1_TRIGGER_TIM8_TRGO
  *         @arg @ref LL_GPDMA1_TRIGGER_TIM8_TRGO2
  *         @arg @ref LL_GPDMA1_TRIGGER_TIM12_TRGO
  *         @arg @ref LL_GPDMA1_TRIGGER_TIM15_TRGO
  *         @arg @ref LL_GPDMA1_TRIGGER_HPDMA1_CH0_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_HPDMA1_CH1_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_HPDMA1_CH2_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_HPDMA1_CH3_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_HPDMA1_CH4_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_HPDMA1_CH5_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_HPDMA1_CH6_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_HPDMA1_CH7_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_HPDMA1_CH8_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_HPDMA1_CH9_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_HPDMA1_CH10_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_HPDMA1_CH11_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_HPDMA1_CH12_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_HPDMA1_CH13_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_HPDMA1_CH14_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_HPDMA1_CH15_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH0_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH1_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH2_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH3_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH4_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH5_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH6_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH7_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH8_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH9_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH10_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH11_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH12_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH13_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH14_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_GPDMA1_CH15_TCF
  *         @arg @ref LL_GPDMA1_TRIGGER_EXTIT0_SYNC
  *         @arg @ref LL_GPDMA1_TRIGGER_EXTIT1_SYNC
  *         @arg @ref LL_GPDMA1_TRIGGER_EXTIT2_SYNC
  *         @arg @ref LL_GPDMA1_TRIGGER_EXTIT3_SYNC
  *         @arg @ref LL_GPDMA1_TRIGGER_EXTIT4_SYNC
  *         @arg @ref LL_GPDMA1_TRIGGER_EXTIT5_SYNC
  *         @arg @ref LL_GPDMA1_TRIGGER_EXTIT6_SYNC
  *         @arg @ref LL_GPDMA1_TRIGGER_EXTIT7_SYNC
  *         @arg @ref LL_GPDMA1_TRIGGER_EXTIT8_SYNC
  *         @arg @ref LL_GPDMA1_TRIGGER_EXTIT9_SYNC
  *         @arg @ref LL_GPDMA1_TRIGGER_EXTIT10_SYNC
  *         @arg @ref LL_GPDMA1_TRIGGER_EXTIT11_SYNC
  *         @arg @ref LL_GPDMA1_TRIGGER_EXTIT12_SYNC
  *         @arg @ref LL_GPDMA1_TRIGGER_EXTIT13_SYNC
  *         @arg @ref LL_GPDMA1_TRIGGER_EXTIT14_SYNC
  *         @arg @ref LL_GPDMA1_TRIGGER_EXTIT15_SYNC
  * @retval None.
  */
__STATIC_INLINE void LL_DMA_SetHWTrigger(const DMA_TypeDef *DMAx, uint32_t Channel, uint32_t Trigger)
{
  uint32_t dma_base_addr = (uint32_t)DMAx;
  MODIFY_REG(((DMA_Channel_TypeDef *)(dma_base_addr + LL_DMA_CH_OFFSET_TAB[Channel]))->CTR2, DMA_CTR2_TRIGSEL,
             (Trigger << DMA_CTR2_TRIGSEL_Pos) & DMA_CTR2_TRIGSEL);
}

